In [3]:
#group By : summary result, grouping

In [4]:
import pandas as pd

# Expanded employee dataset
employee_df = pd.DataFrame({
    'EmployeeID': range(1001, 1016),
    'Name': [
        'Alice Smith', 'Bob Johnson', 'Charlie Lee', 'Diana Prince', 'Evan Stone',
        'Fiona Adams', 'George King', 'Hannah Wu', 'Ian Patel', 'Julia Brown',
        'Kevin Zhao', 'Laura Green', 'Mike Chan', 'Nina Gomez', 'Oscar Rivera'
    ],
    'Department': [
        'HR', 'IT', 'Finance', 'Marketing', 'IT',
        'Finance', 'HR', 'IT', 'Marketing', 'Finance',
        'IT', 'HR', 'Marketing', 'Finance', 'HR'
    ],
    'Position': [
        'Manager', 'Developer', 'Analyst', 'Coordinator', 'SysAdmin',
        'Financial Advisor', 'Recruiter', 'DevOps Engineer', 'Marketing Exec', 'Accountant',
        'Backend Developer', 'HR Specialist', 'Content Manager', 'Risk Analyst', 'Trainer'
    ],
    'Age': [34, 29, 41, 36, 31, 45, 38, 28, 33, 40, 26, 35, 39, 42, 30],
    'Gender': ['F', 'M', 'M', 'F', 'M', 'F', 'M', 'F', 'M', 'F', 'M', 'F', 'M', 'F', 'M'],
    'Salary': [
        75000, 68000, 72000, 65000, 70000,
        85000, 62000, 76000, 69000, 71000,
        67000, 64000, 73000, 78000, 66000
    ],
    'JoiningDate': pd.to_datetime([
        '2017-05-10', '2019-08-01', '2015-03-20', '2020-07-15', '2018-11-30',
        '2013-02-17', '2016-09-10', '2021-01-22', '2019-10-01', '2014-06-18',
        '2020-03-10', '2018-04-05', '2017-11-25', '2016-12-12', '2022-08-08'
    ])
})

#print(employee_df)
employee_df

,EmployeeID,Name,Department,Position,Age,Gender,Salary,JoiningDate
0,1001,Alice Smith,HR,Manager,34,F,75000,2017-05-10
1,1002,Bob Johnson,IT,Developer,29,M,68000,2019-08-01
2,1003,Charlie Lee,Finance,Analyst,41,M,72000,2015-03-20
3,1004,Diana Prince,Marketing,Coordinator,36,F,65000,2020-07-15
4,1005,Evan Stone,IT,SysAdmin,31,M,70000,2018-11-30
5,1006,Fiona Adams,Finance,Financial Advisor,45,F,85000,2013-02-17
6,1007,George King,HR,Recruiter,38,M,62000,2016-09-10
7,1008,Hannah Wu,IT,DevOps Engineer,28,F,76000,2021-01-22
8,1009,Ian Patel,Marketing,Marketing Exec,33,M,69000,2019-10-01
9,1010,Julia Brown,Finance,Accountant,40,F,71000,2014-06-18
10,1011,Kevin Zhao,IT,Backend Developer,26,M,67000,2020-03-10
11,1012,Laura Green,HR,HR Specialist,35,F,64000,2018-04-05
12,1013,Mike Chan,Marketing,Content Manager,39,M,73000,2017-11-25
13,1014,Nina Gomez,Finance,Risk Analyst,42,F,78000,2016-12-12
14,1015,Oscar Rivera,HR,Trainer,30,M,66000,2022-08-08

In [5]:
employee_df[employee_df["Department"]=="IT"]["Salary"].mean() #avg salary of it

np.float64(70250.0)

In [6]:
employee_df[employee_df["Department"]=="HR"]["Salary"].mean() #avg salary of it

np.float64(66750.0)

In [7]:
grouped = employee_df.groupby("Department")

In [8]:
grouped["Salary"].mean()

Department
Finance      76500.0
HR           66750.0
IT           70250.0
Marketing    69000.0
Name: Salary, dtype: float64

In [9]:
grouped["Salary"].max()

Department
Finance      85000
HR           75000
IT           76000
Marketing    73000
Name: Salary, dtype: int64

In [10]:
grouped["Salary"].min()

Department
Finance      71000
HR           62000
IT           67000
Marketing    65000
Name: Salary, dtype: int64

In [11]:
grouped["Salary"].count() # any head can give value while counting

Department
Finance      4
HR           4
IT           4
Marketing    3
Name: Salary, dtype: int64

In [12]:
summary_df=grouped.agg({"Salary":["min","max","count","sum","mean"],"Age":{"mean","max","min"}})

In [13]:
summary_df

           Salary                                  Age
              min    max count     sum     mean   mean min max
Department
Finance     71000  85000     4  306000  76500.0  42.00  40  45
HR          62000  75000     4  267000  66750.0  34.25  30  38
IT          67000  76000     4  281000  70250.0  28.50  26  31
Marketing   65000  73000     3  207000  69000.0  36.00  33  39

In [14]:
grouped.get_group("Marketing")

,EmployeeID,Name,Department,Position,Age,Gender,Salary,JoiningDate
3,1004,Diana Prince,Marketing,Coordinator,36,F,65000,2020-07-15
8,1009,Ian Patel,Marketing,Marketing Exec,33,M,69000,2019-10-01
12,1013,Mike Chan,Marketing,Content Manager,39,M,73000,2017-11-25

In [15]:
grouped.get_group("IT")

,EmployeeID,Name,Department,Position,Age,Gender,Salary,JoiningDate
1,1002,Bob Johnson,IT,Developer,29,M,68000,2019-08-01
4,1005,Evan Stone,IT,SysAdmin,31,M,70000,2018-11-30
7,1008,Hannah Wu,IT,DevOps Engineer,28,F,76000,2021-01-22
10,1011,Kevin Zhao,IT,Backend Developer,26,M,67000,2020-03-10

In [16]:
#summary_df.columns
summary_df.columns.tolist()

[('Salary', 'min'),
 ('Salary', 'max'),
 ('Salary', 'count'),
 ('Salary', 'sum'),
 ('Salary', 'mean'),
 ('Age', 'mean'),
 ('Age', 'min'),
 ('Age', 'max')]

In [17]:
new_col=[]
for item in summary_df.columns.tolist():
    new_col.append(item[0]+"_"+item[1])

In [18]:
new_col

['Salary_min',
 'Salary_max',
 'Salary_count',
 'Salary_sum',
 'Salary_mean',
 'Age_mean',
 'Age_min',
 'Age_max']

In [19]:
summary_df.columns =new_col
summary_df

,Salary_min,Salary_max,Salary_count,Salary_sum,Salary_mean,Age_mean,Age_min,Age_max
Department,,,,,,,,
Finance,71000,85000,4,306000,76500.0,42.00,40,45
HR,62000,75000,4,267000,66750.0,34.25,30,38
IT,67000,76000,4,281000,70250.0,28.50,26,31
Marketing,65000,73000,3,207000,69000.0,36.00,33,39

In [20]:
summary_df.reset_index() # makes index in same position

,Department,Salary_min,Salary_max,Salary_count,Salary_sum,Salary_mean,Age_mean,Age_min,Age_max
0,Finance,71000,85000,4,306000,76500.0,42.00,40,45
1,HR,62000,75000,4,267000,66750.0,34.25,30,38
2,IT,67000,76000,4,281000,70250.0,28.50,26,31
3,Marketing,65000,73000,3,207000,69000.0,36.00,33,39

In [21]:
#unstack